perf/fibonacci.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
          
    node-replicated:
      target: 'http://localhost:5555/node-replicated'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"

  pool: 1 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: start
      duration: 1
      arrivalRate: 5

    - name: Positive Ramp
      duration: 10
      arrivalRate: 10
      rampTo: 60

    - name: Plain
      duration: 100
      arrivalRate: 50

    - name: Negative Ramp
      duration: 15
      arrivalRate: 50
      rampTo: 10

scenarios:
  - name: Fibonacci
    flow:
      - get:
          url: '/fibonacci?n=26'