perf/fibonacci.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
          
    node-replicated:
      target: 'http://localhost:5555/node-replicated'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: start
      duration: 15
      arrivalRate: 5000

    - name: Positive Ramp
      duration: 20
      arrivalRate: 5000
      rampTo: 50000

    - name: Plain
      duration: 40
      arrivalRate: 50000
      
    - name: Negative Ramp
      duration: 15
      arrivalRate: 50000
      rampTo: 5000
      
    - name: final
      duration: 15
      arrivalRate: 2500

scenarios:
  - name: Fibonacci
    flow:
      - get:
          url: '/fibonacci?n=5'